const AboutUs = () => {
  return (
    <div>
      <h2 className="sectionheading">আমাদের সম্পর্কে</h2>

      <section className="bg-gray-100 py-12 px-6 md:px-16">
        <div className="max-w-4xl mx-auto text-center">
          <h2 className="text-xl md:text-2xl font-bold text-gray-800 mb-6">
            নৈতিক সম্পর্ক গঠনে আমাদের উদ্যোগ
          </h2>

          <p className="text-gray-700 text-lg leading-relaxed mb-4 text-justify">
            বর্তমান সময়ে অনেক বিশ্ববিদ্যালয় শিক্ষার্থী অস্পষ্ট ভবিষ্যৎ ও সামাজিক
            চাপে পড়ে নৈতিকতা বিবর্জিত সম্পর্কে জড়িয়ে যায়, যা তাদের মানসিক ও
            সামাজিক জীবনে নেতিবাচক প্রভাব ফেলে। অধিকাংশ ক্ষেত্রে, উপযুক্ত
            সুযোগের অভাব, পরিবারিক জটিলতা, এবং সচেতনতার ঘাটতির কারণে
            শিক্ষার্থীরা এমন সম্পর্কের দিকে ধাবিত হয়, যা দীর্ঘমেয়াদে তাদের জন্য
            ক্ষতিকর হতে পারে। আমাদের ওয়েবসাইট এই সমস্যা সমাধানে কাজ করছে, যাতে
            শিক্ষার্থীরা একটি সুস্থ, সম্মানজনক ও নৈতিক উপায়ে জীবনসঙ্গী খুঁজে
            নিতে পারে। আমাদের প্ল্যাটফর্ম এমন একটি নিরাপদ পরিবেশ তৈরি করে,
            যেখানে শিক্ষার্থীরা দায়িত্বশীলতার সঙ্গে সম্পর্ক গড়ার সুযোগ পায়।
            এখানে আমরা পরিবার ও অভিভাবকদের সম্পৃক্ততা নিশ্চিত করি, যাতে প্রতিটি
            সম্পর্ক পারস্পরিক সম্মান, বিশ্বাস এবং নৈতিকতার ভিত্তিতে গড়ে ওঠে।
            পাশাপাশি, আমরা জীবনসঙ্গী বেছে নেওয়ার ক্ষেত্রে শিক্ষার্থীদের জন্য
            প্রয়োজনীয় দিকনির্দেশনা ও পরামর্শ প্রদান করি, যাতে তারা সচেতন
            সিদ্ধান্ত নিতে পারে। আমাদের লক্ষ্য হলো, তরুণ প্রজন্মকে নৈতিকতা ও
            মূল্যবোধের ভিত্তিতে একটি সুন্দর ও সুস্থ দাম্পত্য জীবনের জন্য
            প্রস্তুত করা। আমরা বিশ্বাস করি, একটি ভালো সম্পর্ক কেবল ব্যক্তিগত
            সুখই নয়, বরং একটি সুস্থ সমাজ গঠনেরও অন্যতম স্তম্ভ।
          </p>
        </div>
      </section>
    </div>
  );
};

export default AboutUs;
